

ad1 = """
☘️ALPHA SCAM

🥇1.000.000 за неделю без 900
⚙️ Никогда не висит ТК, постоянно меняем домены
♻️ Отмываем деньги (два раза через битки, не через БТК Банкира, а через обычные обменники)
💋 Лучшие условия для своих сотрудников 

⚡️НЕДВИЖИМОСТЬ / AVITO / YOULA / CDEK / BOXBERRY + 2.0 на каждый сервис⚡️
Дальше - Больше!

🤖@AlphaScamBot
🤖@AlphaScamBot
🤖@AlphaScamBot
"""


ad2 = """
😼 Информация о проекте MYR TEAM

🕰 Дата открытия: 01.03.2020
👤 Воркеров: 243
💰 Профитов: 53 939 207 р
💸 Выплаты: оплаты - 80%, возвраты - 70%

УНИКАЛЬНЫЙ ДИЗАЙН AВИТО УЖЕ У НАС, КАРТА С ПУНКТАМИ ВЫДАЧИ.
Выплачиваем все профиты,независимо от блоков!
Выплачиваем без скрытых комиссий
Автовывод ваших профитов,в течении 10 минут после залёт выплата

✅ Авито 1.0/2.0
✅ Юла 1.0/2.0
✅ Яндекс
✅ Боксберри 1.0/2.0
✅ Сдэк 1.0/2.0
✅ Недвижимость 1.0/2.0
✅ Письма
✅ СМС


📧 Заявка строго по форме:
• В каких командах работали до нас
• Почему хотите к нам
• Скрины профитов в других командах
🤖По приёму писать @MyrInvite
"""


check_payment = """
Пополнение QIWI:
➖➖➖➖➖➖➖➖
💦 Номер - {}
💦 Комментарий - {}
💦 Дата создания - {}
➖➖➖➖➖➖➖➖
<i><b>Внимание!</b> До конца тикета осталось <b>{} секунд!</b></i>

<i>После окончания времени заявка становится не активной!</i>
"""


info = """
🏦 <b>Ваш баланс:</b> <code>{} RUB</code>
🙋🏻‍♂️ <b>Ваш id:</b> <code>{}</code>
🛍 <b>Кол-во покупок:</b> <code>{}</code>
🎲 <b>Кол-во игр:</b> <code>{}</code>
🧮 <b>Ваша скидка:</b> <code>{} %</code>
Cлит в @end_soft
"""


raffle = """
💸💸💸 <b>Внимание! Розыгрыш</b> <code>{} RUB</code> <b>на баланс!</b>

🛍 <b>1 Условие:</b> <code>{} покупок(ки/ка)</code>
🎲 <b>2 Условие:</b> <code>{} игр(ы/а)</code>

⏱ <b>Результаты через</b> <code>{} минут</code>

👨‍ <b>Участников:</b> <code>{}</code>
📊 <b>Шанс:</b> <code>{} %</code>
"""

pact = """
Пользовательское соглашение
1. Порядок проведения активации следующий:
- 1.1. Нажать на кнопку "Купить", выбрать необходимый сервис
- 1.2  Нажать на нужнйы сервис, выбрать необходимую страну
- 1.3  Нажать на кнопку "Получить код"
- 1.4  Дождаться поступления смс и отображения его содержания
- 1.5  Если все верно и вы хотите закончить работу с данным сервисом необходимо нажать кнопку "✅ Подтвердить получение"
- 1.6  Максимальное время ожидания поступления смс составляет 15 минут, после чего выделение номера завершается.

2. Стоимость активаций списывается согласно прейскуранту (Отображается до покупки номера).
- 2.1 Деньги списываются с баланса по завершению операции (п.1.4,1.5 регламента).

3. Если номер выделен, но не использован (то есть вы не увидели код из смс), вы можете в любой момент отменить операцию без какого-либо штрафа.

4. При использовании данного бота вы даёте согласие на получение рекламных материалов от @WAVE_SMS_BOT.

5. История операций с номерами хранится на сервере и не подлежит удалению.

6.  Категорически запрещенно использование данного сервиса @WAVE_SMS_BOT в любых противоправных целях.
- 6.1 Также запрещенно использовать данные номера с последующими целями, нарушающие Уголовный Кодекс Российской Федерации: обман, мошенничество и прочие (УК РФ 138, УК РФ 159, УК РФ 228, УК РФ 272, УК РФ 273, УК РФ 274)
- 6.2 Запрещено использование сервиса для осуществления платных подписок.

7. Мы не несем ответственности за созданные аккаунты, все действия, включая возможные блокировки, осуществляются исключительно на страх и риск конечного пользователя, который приобрел активацию

8. Возврат денежных средств за ошибки пользователей - не предусмотрен

9. Использование ошибок или брешей в системе безопасности запрещено и квалифицируется по УК РФ ст.273
Нажимая на кнопку "Подтверждаю согласие", вы подтвердаете согласие с пользовательским соглашением.
"""